app/controllers/microposts_controller.rb

  def create
    @micropost = current_user.microposts.build(micropost_params)
    if @micropost.save
---
INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "test"], ["user_id", 2], ["created_at", "2016-12-11 10:46:48.438117"], ["updated_at", "2016-12-11 10:46:48.438117"]]

  def destroy
    @micropost = current_user.microposts.find_by(id: params[:id])
    return redirect_to root_url if @micropost.nil?
    @micropost.destroy
---
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ? AND "microposts"."id" = ? LIMIT 1  [["user_id", 1], ["id", 10]]
DELETE FROM "microposts" WHERE "microposts"."id" = ?  [["id", 10]]