app/controllers/static_pages_controller.rb

SELECT  "microposts".* FROM "microposts" WHERE "microposts"."user_id" IN (2, 3, 1)  ORDER BY "microposts"."created_at" DESC LIMIT 2 OFFSET 0
SELECT "users".* FROM "users" WHERE "users"."id" IN (1, 3)
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "microposts" WHERE "microposts"."user_id" IN (2, 3, 1) LIMIT 2 OFFSET 0) subquery_for_count
---
  def home
    if logged_in?
      @micropost = current_user.microposts.build
      @feed_items = current_user.feed_items.includes(:user).order(created_at: :desc).page(params[:page]).per(2)