app/controllers/users_controller.rb

  def index
    users = User.all
    @users = users.page(params[:page]).per(2)
---
SELECT "users".* FROM "users"
SELECT  "users".* FROM "users" LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM "users"

  def show
    @user = User.find(params[:id])
    @microposts = @user.microposts.order(created_at: :desc).page(params[:page]).per(2)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ?  ORDER BY "microposts"."created_at" DESC LIMIT 2 OFFSET 2  [["user_id", 1]]
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 2]]

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def update
    if (@user.update(user_profile))
---
UPDATE "users" SET "place" = ?, "profile" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["place", "hokkaido"], ["profile", ""], ["updated_at", "2016-12-17 15:11:44.278070"], ["id", 1]]

  def following
    @title = "Following"
    @user  = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

  def followers
    @title = "Followers"
    @user  = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]